-- 그룹함수
--1. 각 부서별로 최대 급여를 구하세요.

--2. 각 직급(JOB)별로 최대 급여를 구하세요.

--3. 각 부서별로 평균 급여를 구하세요.

--4. 각 직급(JOB)별의 인원수를 구하세요.

--5. 각 부서별 인원수와 추가수당(COMM)을 받는 인원수를 구하세요.

--6. 각 년도별로 입사한 인원수를 구하세요.

--7. 부서별 평균 급여를 구하고 그 결과로 평균 급여가 2000 이상인 부서만 출력하세요.

--8. 급여가 1000 이상인 사람들로 부서별 평균 급여를 구하고 그 결과로 평균급여가 2000이상인 부서만 출력하세요.
----------------------------------------------------------------------------------------------------------------
-- 조인
--1. 사원이름이 SCOTT인 사원의 사번(EMPNO), 이름(ENAME),  부서명(DNAME)을 출력하세요.

--2. 사원이름(ENAME)과 급여(SAL)와 급여등급(GRADE)을 출력하세요.

--3. 위 2번문제에서 부서명을 추가시켜 출력하세요.

--4. 사원이름과 매니저의 이름을 아래와 같은 형식으로 출력하세요.
--	"XXX"의 매니저는 "XXX" 입니다.

--5. 부서번호(DEPTNO)가 30번인 사원들의 이름(ENAME), 직급(JOB), 부서번호(DEPTNO), 부서위치(LOC)를 출력하세요.

--6. 보너스(COMM)를 받은 사원의 이름(ENAME), 보너스(COMM), 부서명(DNAME), 부서위치(LOC)를 출력하세요.

--7. DALLAS에서 근무하는 사원들의 이름(ENAME), 직급(JOB), 부서번호(DEPTNO), 부서명(DNAME)을 출력하세요.

--8. 이름에 'A'가 들어가는 사원들의 이름(ENAME)과 부서명(DNAME)을 출력하세요.

